Ran Plan for 2 projects:

1. dir: `infra/us-east-1/mgmt/ecr` workspace: `default`
1. dir: `infra/us-east-1/prod/kms` workspace: `default`

### 1. dir: `infra/us-east-1/mgmt/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-15T14:46:31Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ecr.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.22.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=3792795651]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
+   resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "keep last 20 images"
+                       rulePriority = 10
+                       selection    = {
+                           countNumber = 20
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire untagged images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

  # aws_ecr_repository.this[0] will be created
+   resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "scde"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)

+       encryption_configuration {
+           encryption_type = "AES256"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
+   resource "aws_ecr_repository_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "ecr:ListTagsForResource",
+                           "ecr:ListImages",
+                           "ecr:GetRepositoryPolicy",
+                           "ecr:GetLifecyclePolicyPreview",
+                           "ecr:GetLifecyclePolicy",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:GetAuthorizationToken",
+                           "ecr:DescribeRepositories",
+                           "ecr:DescribeImages",
+                           "ecr:DescribeImageScanFindings",
+                           "ecr:BatchGetImage",
+                           "ecr:BatchCheckLayerAvailability",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Sid       = "PrivateReadOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   repository_arn         = (known after apply)
+   repository_registry_id = (known after apply)
+   repository_url         = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/ecr`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/ecr`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `infra/us-east-1/prod/kms` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_kms_key.this[0] will be updated in-place
!   resource "aws_kms_key" "this" {
        id                                 = "arn:aws:kms:us-east-1:677160962006:key/e8ccc1e3-c590-42f9-bda3-f7a55dcd787c"
!       policy                             = jsonencode(
!           {
!               Statement = [
!                   {
!                       Principal = {
!                           AWS = "arn:aws:iam::677160962006:root" -> [
+                               "arn:aws:iam::677160962006:root",
+                               "arn:aws:iam::677160962006:fenton.haslam",
                            ]
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:Update*",
                            "kms:UntagResource",
                            "kms:TagResource",
                            "kms:ScheduleKeyDeletion",
                            "kms:Revoke*",
                            "kms:ReplicateKey",
                            "kms:Put*",
                            "kms:List*",
                            "kms:ImportKeyMaterial",
                            "kms:Get*",
                            "kms:Enable*",
                            "kms:Disable*",
                            "kms:Describe*",
                            "kms:Delete*",
                            "kms:Create*",
                            "kms:CancelKeyDeletion",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = [
                                "arn:aws:iam::677160962006:user/shea.levy",
                                "arn:aws:iam::677160962006:user/rene.barbosa",
                                "arn:aws:iam::677160962006:user/olaniyi.oshunbote",
                                "arn:aws:iam::677160962006:user/oguzhan.boran",
                                "arn:aws:iam::677160962006:user/fenton.haslam",
                                "arn:aws:iam::677160962006:user/daniel.thagard",
                                "arn:aws:iam::677160962006:user/alexsander.falcucci",
                                "arn:aws:iam::677160962006:role/dapps-world",
                                "arn:aws:iam::677160962006:role/OrganizationAccountAccessRole",
                            ]
                        }
                        Resource  = "*"
                        Sid       = "KeyAdministration"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {}
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
!   key_policy                    = jsonencode(
!       {
!           Statement = [
!               {
!                   Principal = {
!                       AWS = "arn:aws:iam::677160962006:root" -> [
+                           "arn:aws:iam::677160962006:root",
+                           "arn:aws:iam::677160962006:fenton.haslam",
                        ]
                    }
                    # (4 unchanged attributes hidden)
                },
                {
                    Action    = [
                        "kms:Update*",
                        "kms:UntagResource",
                        "kms:TagResource",
                        "kms:ScheduleKeyDeletion",
                        "kms:Revoke*",
                        "kms:ReplicateKey",
                        "kms:Put*",
                        "kms:List*",
                        "kms:ImportKeyMaterial",
                        "kms:Get*",
                        "kms:Enable*",
                        "kms:Disable*",
                        "kms:Describe*",
                        "kms:Delete*",
                        "kms:Create*",
                        "kms:CancelKeyDeletion",
                    ]
                    Effect    = "Allow"
                    Principal = {
                        AWS = [
                            "arn:aws:iam::677160962006:user/shea.levy",
                            "arn:aws:iam::677160962006:user/rene.barbosa",
                            "arn:aws:iam::677160962006:user/olaniyi.oshunbote",
                            "arn:aws:iam::677160962006:user/oguzhan.boran",
                            "arn:aws:iam::677160962006:user/fenton.haslam",
                            "arn:aws:iam::677160962006:user/daniel.thagard",
                            "arn:aws:iam::677160962006:user/alexsander.falcucci",
                            "arn:aws:iam::677160962006:role/dapps-world",
                            "arn:aws:iam::677160962006:role/OrganizationAccountAccessRole",
                        ]
                    }
                    Resource  = "*"
                    Sid       = "KeyAdministration"
                },
                # (1 unchanged element hidden)
            ]
            # (1 unchanged attribute hidden)
        }
    )
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/kms`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Fkms%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/kms`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`